class PickerData {
  static List xqxnPickerData = [
    [
      "2021-2022",
      "2020-2021",
      "2019-2020",
      "2018-2019",
      "2017-2018",
      "2016-2017"
    ],
    [
      '第1学期',
      '第2学期',
      '第3学期',
    ],
  ];
  static List xqxnWithAllTermPickerData = [
    [
      "全部学年",
      "2021-2022",
      "2020-2021",
      "2019-2020",
      "2018-2019",
      "2017-2018",
      "2016-2017"
    ],
    [
      '全部学期',
      '第1学期',
      '第2学期',
      '第3学期',
    ],
  ];
  static var apartment = [
    {
      "杏苑": ["杏1楼","杏2楼","杏3楼",]
    },
    {
      "竹苑": ["竹1楼","竹2楼","竹3楼","竹4楼"]
    },
    {
      "松苑": ["松1楼","松2楼","松3楼","松4楼"]
    },
    {
      "桃苑": ["桃1楼","桃2楼","桃3楼","桃4楼","桃5楼"]
    },
    {
      "梅苑": ["梅1楼","梅2楼","梅3楼"]
    },
    {
      "研究生": ["研1","研2","研3"]
    },
  ];
}
